<?php

use Illuminate\Database\Seeder;

class categoriesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $sardaste=["خرید","حمل و نقل","بهداشت و درمان","خدمات شهری","کافه رستوران","فرهنگی تفریحی ","زیبایی و تندرستی ","سلامت و درمان"];
        $daste=["پوشاک","سوپرمارکت","قطار","تاکسی تلفنی","تجهیزات پزشکی","داروخانه","بانک","سینما",
        "پمپ بنزین","حمل و نقل شهری","باربری","تاکسی بانوان","خدمات خودرو","سفر و گردشگری","آموزشگاه ","لوازم و تحریر",
        "مراکز آموزش عالی","مدارس","مطب پزشکان","عطاری","داروخانه شبانه","بیمارستان","طب فیزیکی ","اسباب بازی",
        "پارک","بوستان","اتاق کودک","سیسمونی","آهنگری","آهنگ سازی","تعمیرگاه","آموزشگاه زبان"
        ,"خرازی","پارچه فروشی","دسمال فروشی","جهیزیه","لوازم خانگی","کامپیوتری","خدمات رایانه","فروش لپ تاپ","فروش موبایل","فروش تبلت",
        "لوازم جانبی موبایل","مبل فروشی","عکاسی","آتلیه","فیلمبرداری","تالار","کافی شاپ","فست فود",
        "پوشاک","سوپرمارکت","قطار","تاکسی تلفنی","تجهیزات پزشکی","داروخانه","بانک","سینما",
        "پمپ بنزین","حمل و نقل شهری","باربری","تاکسی بانوان","خدمات خودرو","سفر و گردشگری","آموزشگاه ","لوازم و تحریر",
        "مراکز آموزش عالی","مدارس","مطب پزشکان","عطاری","داروخانه شبانه","بیمارستان","طب فیزیکی ","اسباب بازی",
        "پارک","بوستان","اتاق کودک","سیسمونی","آهنگری","آهنگ سازی","تعمیرگاه","آموزشگاه زبان"
        ,"خرازی","پارچه فروشی","دسمال فروشی","جهیزیه","لوازم خانگی","کامپیوتری","خدمات رایانه","فروش لپ تاپ","فروش موبایل","فروش تبلت",
        "لوازم جانبی موبایل","مبل فروشی","عکاسی","آتلیه","فیلمبرداری","تالار","کافی شاپ","فست فود"
    ]; 
      
        $fake=\Faker\Factory::create('fa_IR');
    	for ($i=0; $i <8; $i++) { 
            $place=$sardaste[$i];
	    	DB::table('categories')->insert([
                'parentID'=>0,
                'Category'=>$place,
	        ]);
        }
        for ($i=9; $i <count($daste); $i++) { 
            $place=$daste[$i-9];
            DB::table('categories')->insert([
                'parentID'=>rand(1,8),
                'Category'=>$place,
               
            ]);
        }
       
        }
    }
